name: "ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ 720, 1280, 3 ]
  }
]

output [
  {
    name: "bounding_boxes"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
    label_filename: "labels.txt"
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "image"
        value: "image"
      }
      output_map {
        key: "resized_image"
        value: "resized_image"
      }
    },
    {
      model_name: "object_detection"
      model_version: -1
      input_map {
        key: "images"
        value: "resized_image"
      }
      output_map {
        key: "output0"
        value: "detections"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "detections"
        value: "detections"
      }
      output_map {
        key: "bounding_boxes"
        value: "bounding_boxes"
      }
    }
  ]
}

version_policy: { 
  latest: { num_versions: 1 }
}
