name: "postprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "detections"
    data_type: TYPE_FP16
    dims: [ -1, -1, -1 ]
  }
]

output [
  {
    name: "bounding_boxes"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

version_policy: { 
  latest: { num_versions: 1 }
}
