name: "preprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]
 
output [
  {
    name: "resized_image"
    data_type: TYPE_FP16
    dims: [ 1, 3, 640, 640 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]

version_policy: { 
  latest: { num_versions: 1 }
}
